balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GC010.PIC
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CONFIG2" edc:default="0xffff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG2" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMD" edc:desc="Primary Oscillator Select" edc:mask="0x3" edc:name="POSCMD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Primary Oscillator Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS Oscillator Enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT Oscillator Enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="External-Clock Mode Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES0" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x1" edc:name="RES0" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTCLK" edc:desc="WDT Clock Source Select bits" edc:mask="0x3" edc:name="WDTCLK" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="WDT uses LPRC" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="WDT uses 31 kHz source from FRC when active in Windowed WDT" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="WDT uses SOSC input" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SYSCLK" edc:desc="WDT uses system clock when active, LPRC while in Sleep mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFCN" edc:desc="OSCO Pin Configuration" edc:mask="0x1" edc:name="OSCIOFCN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="OSCO/CLKO/RC15 functions as port I/O (RC15)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSCO/CLKO/RC15 functions as CLKO (FOSC/2)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Fail-Safe Clock Monitor Configuration bits" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Clock switching and Fail-Safe Clock Monitor are disabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled, Fail-Safe Clock Monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Clock switching is enabled, Fail-Safe Clock Monitor is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Initial Oscillator Select" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC Oscillator with Postscaler (FRCDIV)" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low-Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary Oscillator with PLL module (XTPLL,HSPLL, ECPLL)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary Oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Fast RC Oscillator with PLL module (FRCPLL)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Fast RC Oscillator (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ALTADREF" edc:desc="External 12-Bit A/D Reference Location Select bit" edc:mask="0x1" edc:name="ALTADREF" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="AVREF_RA" edc:desc="AVREF+/AVREF- are mapped to RA9/RA10" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="AVREF_RB" edc:desc="AVREF+/AVREF- are mapped to RB0/RB1" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ALTCVREF" edc:desc="External Comparator Reference Location Select bit" edc:mask="0x1" edc:name="ALTCVREF" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="CVREF_RA" edc:desc="CVREF+/CVREF- are mapped to RA9/RA10" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CVREF_RB" edc:desc="CVREF+/CVREF- are mapped to RB0/RB1" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTCMX" edc:desc="WDT Clock Source Select bits" edc:mask="0x1" edc:name="WDTCMX" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="WDTCLK" edc:desc="WDT clock source is determined by the WDTCLK Configuration bits" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="WDT always uses LPRC as its clock source" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES3" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x1" edc:name="RES3" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal External Switchover" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
