balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GC010.PIC
    </edc:WORMHoleSector>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8007c0" edc:beginaddr="0x800000" edc:endaddr="0x800800" edc:regionid="testmem"/>
    <edc:ConfigWORMSector edc:beginaddr="0xf80000" edc:endaddr="0xf80014" edc:regionid="cfgwormmem"/>
    <edc:DeviceIDSector edc:beginaddr="0xff0000" edc:endaddr="0xff0004" edc:mask="0xffff0000" edc:regionid="devid" edc:value="0x48850000"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x800000" edc:endaddr="0x800008" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:xbeginaddr="0x800" edc:xendaddr="0x2800">
    <edc:RegardlessOfMode>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd0046" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x800" edc:endaddr="0x2800" edc:regionid="data"/>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x800" edc:regionid="sfrs">
        <edc:Module_ref edc:begin="0x0" edc:end="0x22" edc:modsrc="DOS-00543.PIC24_CPU_with_EDS.Module"/>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x22" edc:end="0x2C" edc:modsrc="DOS-00543.PIC24_CPU_with_EDS.Module"/>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:Module_ref edc:begin="0x2C" edc:end="0x30" edc:modsrc="DOS-00543.PIC24_CPU_with_EDS.Module"/>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x30" edc:end="0x34" edc:modsrc="DOS-00543.PIC24_CPU_with_EDS.Module"/>
        <edc:Module_ref edc:begin="0xA" edc:end="0x2e" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleExclude edc:impl="0xfffc" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0xc3ff" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0xf" edc:offset="0x14"/>
          <edc:ModuleExclude edc:impl="0xfffc" edc:offset="0x16"/>
          <edc:ModuleExclude edc:impl="0xc3ff" edc:offset="0x18"/>
          <edc:ModuleExclude edc:impl="0xf" edc:offset="0x20"/>
          <edc:ModuleExclude edc:impl="0xfffc" edc:offset="0x22"/>
          <edc:ModuleExclude edc:impl="0xc3ff" edc:offset="0x24"/>
          <edc:ModuleExclude edc:impl="0x000f" edc:offset="0x2c"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x4" edc:end="0x44" edc:modsrc="DOS-Interrupt_16bit.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x44" edc:end="0x48" edc:modsrc="DOS-Interrupt_16bit.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x48" edc:end="0x54" edc:modsrc="DOS-Interrupt_16bit.Module">
          <edc:ModuleExclude edc:impl="0xfff0" edc:offset="0x4c"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x54" edc:end="0x58" edc:modsrc="DOS-Interrupt_16bit.Module"/>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x58" edc:end="0x5c" edc:modsrc="DOS-Interrupt_16bit.Module"/>
        <edc:AdjustPoint edc:offset="30"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x14" edc:modsrc="DOS-01314_tmr_16b_v3_16bit.Module">
          <edc:ModuleMacro edc:replace="%y%" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="1"/>
          <edc:ModuleMacro edc:replace="%z%" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x6" edc:end="0x14" edc:modsrc="DOS-01314_tmr_16b_v3_16bit.Module">
          <edc:ModuleMacro edc:replace="%y%" edc:with="4"/>
          <edc:ModuleMacro edc:replace="%z%" edc:with="5"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="30"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="22"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00700_i2c_v2_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00700_i2c_v2_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01524_spi_v4.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x6" edc:end="0x8" edc:modsrc="DOS-01524_spi_v4.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01359_amp_opamp_con_v1.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01359_amp_opamp_con_v1.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01524_spi_v4.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x6" edc:end="0x8" edc:modsrc="DOS-01524_spi_v4.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="70"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="A"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0x6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="B"/>
          <edc:ModuleExclude edc:impl="0xf0ff" edc:offset="0"/>
          <edc:ModuleExclude edc:impl="0xf0ff" edc:offset="2"/>
          <edc:ModuleExclude edc:impl="0xf0ff" edc:offset="6"/>
          <edc:ModuleExclude edc:impl="0xf0ff" edc:offset="4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="C"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0x6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="D"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="E"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0x6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="F"/>
          <edc:ModuleExclude edc:impl="0x31bf" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0x31bf" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x31bf" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0x31bf" edc:offset="0x6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="G"/>
          <edc:ModuleExclude edc:impl="0xf3cf" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf3cf" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xf3cf" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xf3cf" edc:offset="0x6"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x1e" edc:end="0x20" edc:modsrc="DOS-01094_ppi_pmp_v3_16bit.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x80" edc:modsrc="DOS-01434_adc_12b_upb_v1.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x12" edc:modsrc="DOS-00890_dma_sfr16bit_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0x12" edc:modsrc="DOS-00890_dma_sfr16bit_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0x12" edc:modsrc="DOS-00890_dma_sfr16bit_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0x12" edc:modsrc="DOS-00890_dma_sfr16bit_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0x12" edc:modsrc="DOS-00890_dma_sfr16bit_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0x12" edc:modsrc="DOS-00890_dma_sfr16bit_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="60"/>
        <edc:Module_ref edc:begin="0x80" edc:end="0x94" edc:modsrc="DOS-01434_adc_12b_upb_v1.Module"/>
        <edc:AdjustPoint edc:offset="44"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x4" edc:modsrc="DOS-01360_dac_nbit_ctrl_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x4" edc:modsrc="DOS-01360_dac_nbit_ctrl_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="56"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x4a" edc:modsrc="DOS-01511_usb_otgcore_v4_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-01363_sdm_dig_v1_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-ANCFG_16bit.Module"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0xA" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="A"/>
          <edc:ModuleExclude edc:impl="0xc0fe" edc:offset="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0xA" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="B"/>
          <edc:ModuleExclude edc:impl="0xf0ff" edc:offset="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0xA" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="C"/>
          <edc:ModuleExclude edc:impl="0x001a" edc:offset="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0xA" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="D"/>
          <edc:ModuleExclude edc:impl="0xfffd" edc:offset="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0xA" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="E"/>
          <edc:ModuleExclude edc:impl="0x0200" edc:offset="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0xA" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="F"/>
          <edc:ModuleExclude edc:impl="0x213c" edc:offset="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x8" edc:end="0xA" edc:modsrc="DOS-PORTx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="G"/>
          <edc:ModuleExclude edc:impl="0x83c0" edc:offset="8"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="18"/>
        <edc:Module_ref edc:begin="0x94" edc:end="0xa4" edc:modsrc="DOS-01434_adc_12b_upb_v1.Module"/>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0xa4" edc:end="0xb6" edc:modsrc="DOS-01434_adc_12b_upb_v1.Module"/>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0xbc" edc:end="0xca" edc:modsrc="DOS-01434_adc_12b_upb_v1.Module"/>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:Module_ref edc:begin="0xd0" edc:end="0xde" edc:modsrc="DOS-01434_adc_12b_upb_v1.Module"/>
        <edc:AdjustPoint edc:offset="24"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-01237_lcd_64x8_v1_16bit.Module"/>
        <edc:Module_ref edc:begin="0x10" edc:end="0x50" edc:modsrc="DOS-01237_lcd_64x8_v1_16bit.Module"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0x10" edc:modsrc="DOS-01237_lcd_64x8_v1_16bit.Module"/>
        <edc:AdjustPoint edc:offset="48"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1e" edc:modsrc="DOS-01094_ppi_pmp_v3_16bit.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-01303_tmr_rtcc_v3_16bit.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01370_txm_mod_v2_16bit.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01492_Comparator_Vref_dac_5bit_v3.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0x6" edc:modsrc="DOS-01492_Comparator_Vref_dac_5bit_v3.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0x6" edc:modsrc="DOS-01492_Comparator_Vref_dac_5bit_v3.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01116.Module"/>
        <edc:AdjustPoint edc:offset="32"/>
        <edc:Module_ref edc:begin="0x2" edc:end="0x8" edc:modsrc="DOS-ANCFG_16bit.Module"/>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="INT1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="OCTRIG1"/>
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="INT3"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INT2"/>
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="OCTRIG2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INT4"/>
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC4"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC6"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC5"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="10"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC8"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC7"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="11"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="OCFB"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="OCFA"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC9"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INDX1"/>
          <edc:ModuleExclude edc:impl="0xff00" edc:offset="0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="17"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U3RX"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INDX2"/>
          <edc:ModuleExclude edc:impl="0xff00" edc:offset="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="18"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U1CTS"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U1RX"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="19"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U2CTS"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U2RX"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="20"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="SCK1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SDI1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="21"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U3CTS"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SS1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="22"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="SCK2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SDI2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="23"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="TMRCK"/>
