balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GC010.PIC
          <edc:ModuleMacro edc:replace="%y%" edc:with="SS2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="27"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U4CTS"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U4RX"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR30" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR30" edc:nzwidth="16" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDMIR" edc:desc="" edc:mask="0x3f" edc:name="MDMIR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDMINR" edc:desc="" edc:mask="0x3f" edc:name="MDMINR" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPINRx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="31"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="MDC1"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="MDC2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="3"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="5"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="7"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="9"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="11"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="10"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="13"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="12"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="15"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="14"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="17"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="16"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="19"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="18"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="10"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="21"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="20"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="11"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="23"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="22"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="12"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="25"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="24"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="13"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="26"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="27"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="14"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="29"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="28"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="31"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="30"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="17"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="35"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="34"/>
          <edc:ModuleExclude edc:impl="0xff00" edc:offset="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-RPORx_16bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="18"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="37"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="36"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="90"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01446_rst_sib_v3_16bit.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01381_clk_sib_v10_16bit.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x2" edc:end="0x4" edc:modsrc="DOS-01381_clk_sib_v10_16bit.Module">
          <edc:ModuleExclude edc:impl="0xffef" edc:offset="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x6" edc:end="0x8" edc:modsrc="DOS-01381_clk_sib_v10_16bit.Module"/>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-00822.Module"/>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-00850_lvd_ctrl_v1_16bit.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2_16bit.Module">
          <edc:ModuleExclude edc:impl="0x8007" edc:offset="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-00892_nvm_tsmc18_v1_16bit.Module">
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x4" edc:modsrc="DOS-01446_rst_sib_v3_16bit.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x6" edc:end="0x8" edc:modsrc="DOS-00892_nvm_tsmc18_v1_16bit.Module"/>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-PMDx_16bit.Module">
          <edc:ModuleExclude edc:impl="0xfffe" edc:offset="0xa"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01293.Module"/>
        <edc:AdjustPoint edc:offset="112"/>
      </edc:SFRDataSector>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="SEG51"/>
      <edc:VirtualPin edc:name="CTED3"/>
      <edc:VirtualPin edc:name="CN82"/>
      <edc:VirtualPin edc:name="RG15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="SEG51"/>
      <edc:VirtualPin edc:name="CTED3"/>
      <edc:VirtualPin edc:name="CN82"/>
      <edc:VirtualPin edc:name="RG15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="CTED4"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="LCDBIAS2"/>
      <edc:VirtualPin edc:name="CN63"/>
      <edc:VirtualPin edc:name="RE5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="LCDBIAS1"/>
      <edc:VirtualPin edc:name="CN64"/>
      <edc:VirtualPin edc:name="RE6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="LCDBIAS0"/>
      <edc:VirtualPin edc:name="CN65"/>
      <edc:VirtualPin edc:name="RE7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RPI38"/>
      <edc:VirtualPin edc:name="SEG32"/>
      <edc:VirtualPin edc:name="CN45"/>
      <edc:VirtualPin edc:name="RC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RPI39"/>
      <edc:VirtualPin edc:name="SEG52"/>
      <edc:VirtualPin edc:name="CN46"/>
      <edc:VirtualPin edc:name="RC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RPI40"/>
      <edc:VirtualPin edc:name="SEG33"/>
      <edc:VirtualPin edc:name="CN47"/>
      <edc:VirtualPin edc:name="RC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="AN16"/>
      <edc:VirtualPin edc:name="RPI41"/>
      <edc:VirtualPin edc:name="SEG53"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="CN48"/>
      <edc:VirtualPin edc:name="RC4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="AN17"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="RP21"/>
      <edc:VirtualPin edc:name="SEG0"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="CN8"/>
      <edc:VirtualPin edc:name="RG6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="VLCAP1"/>
      <edc:VirtualPin edc:name="AN18"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="RP26"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="CN9"/>
      <edc:VirtualPin edc:name="RG7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="VLCAP2"/>
      <edc:VirtualPin edc:name="AN19"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="RP19"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="CN10"/>
      <edc:VirtualPin edc:name="RG8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="AN20"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="RP27"/>
      <edc:VirtualPin edc:name="SEG1"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="CN11"/>
      <edc:VirtualPin edc:name="RG9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="TMS"/>
      <edc:VirtualPin edc:name="CTED0"/>
      <edc:VirtualPin edc:name="SEG49"/>
      <edc:VirtualPin edc:name="CN33"/>
      <edc:VirtualPin edc:name="RA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RPI33"/>
      <edc:VirtualPin edc:name="SEG34"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="CN66"/>
      <edc:VirtualPin edc:name="RE8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="AN21"/>
      <edc:VirtualPin edc:name="RPI34"/>
      <edc:VirtualPin edc:name="SEG35"/>
      <edc:VirtualPin edc:name="PMA19"/>
      <edc:VirtualPin edc:name="CN67"/>
      <edc:VirtualPin edc:name="RE9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="PGEC3"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="RP18"/>
      <edc:VirtualPin edc:name="SEG2"/>
      <edc:VirtualPin edc:name="CN7"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="PGED3"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="RP28"/>
      <edc:VirtualPin edc:name="SEG3"/>
      <edc:VirtualPin edc:name="CN6"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="SEG4"/>
      <edc:VirtualPin edc:name="CN5"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="RP13"/>
      <edc:VirtualPin edc:name="SEG5"/>
      <edc:VirtualPin edc:name="CTED13"/>
      <edc:VirtualPin edc:name="CTCMP"/>
      <edc:VirtualPin edc:name="CN4"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="PGEC1"/>
      <edc:VirtualPin edc:name="CVREF-"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="RP1"/>
      <edc:VirtualPin edc:name="SEG6"/>
      <edc:VirtualPin edc:name="CTED12"/>
      <edc:VirtualPin edc:name="CN3"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="PGED1"/>
      <edc:VirtualPin edc:name="CVREF+"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="RP0"/>
      <edc:VirtualPin edc:name="SEG7"/>
      <edc:VirtualPin edc:name="CN2"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="PGEC2"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="RP6"/>
      <edc:VirtualPin edc:name="LCDBIAS3"/>
      <edc:VirtualPin edc:name="CN24"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="PGED2"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="RP7"/>
      <edc:VirtualPin edc:name="CN25"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="SEG36"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="CN41"/>
      <edc:VirtualPin edc:name="RA9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="SEG37"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="CN42"/>
      <edc:VirtualPin edc:name="RA10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="RP8"/>
      <edc:VirtualPin edc:name="SEG31"/>
      <edc:VirtualPin edc:name="COM7"/>
      <edc:VirtualPin edc:name="CN26"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="RP9"/>
      <edc:VirtualPin edc:name="SEG30"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="COM6"/>
      <edc:VirtualPin edc:name="CN27"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="CVREF"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="SEG29"/>
      <edc:VirtualPin edc:name="COM5"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="CN28"/>
      <edc:VirtualPin edc:name="RB10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="CN29"/>
      <edc:VirtualPin edc:name="RB11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="TCK"/>
      <edc:VirtualPin edc:name="CN34"/>
      <edc:VirtualPin edc:name="RA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RP31"/>
      <edc:VirtualPin edc:name="SEG54"/>
      <edc:VirtualPin edc:name="CN76"/>
      <edc:VirtualPin edc:name="RF13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RPI32"/>
      <edc:VirtualPin edc:name="SEG55"/>
      <edc:VirtualPin edc:name="CTED7"/>
      <edc:VirtualPin edc:name="PMA18"/>
      <edc:VirtualPin edc:name="CN75"/>
      <edc:VirtualPin edc:name="RF12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="SEG18"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="CN30"/>
      <edc:VirtualPin edc:name="RB12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="SEG19"/>
      <edc:VirtualPin edc:name="CN31"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="AN14"/>
      <edc:VirtualPin edc:name="RP14"/>
      <edc:VirtualPin edc:name="SEG8"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="CN32"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="RP29"/>
      <edc:VirtualPin edc:name="SEG9"/>
      <edc:VirtualPin edc:name="REFO"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="CN12"/>
      <edc:VirtualPin edc:name="RB15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RPI43"/>
      <edc:VirtualPin edc:name="SEG38"/>
      <edc:VirtualPin edc:name="CN20"/>
      <edc:VirtualPin edc:name="RD14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="RP5"/>
      <edc:VirtualPin edc:name="SEG39"/>
      <edc:VirtualPin edc:name="CN21"/>
      <edc:VirtualPin edc:name="RD15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RP10"/>
      <edc:VirtualPin edc:name="SEG10"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="CN17"/>
      <edc:VirtualPin edc:name="RF4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RP17"/>
      <edc:VirtualPin edc:name="SEG11"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="CN18"/>
      <edc:VirtualPin edc:name="RF5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RP16"/>
      <edc:VirtualPin edc:name="SEG12"/>
      <edc:VirtualPin edc:name="CN71"/>
      <edc:VirtualPin edc:name="RF3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RP30"/>
      <edc:VirtualPin edc:name="SEG40"/>
      <edc:VirtualPin edc:name="CN70"/>
      <edc:VirtualPin edc:name="RF2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RP15"/>
      <edc:VirtualPin edc:name="SEG41"/>
      <edc:VirtualPin edc:name="CN74"/>
      <edc:VirtualPin edc:name="RF8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="CN83"/>
      <edc:VirtualPin edc:name="RF7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="CN84"/>
      <edc:VirtualPin edc:name="RF6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="SEG47"/>
      <edc:VirtualPin edc:name="CN73"/>
      <edc:VirtualPin edc:name="RG3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="SEG28"/>
      <edc:VirtualPin edc:name="CN72"/>
      <edc:VirtualPin edc:name="RG2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="SEG56"/>
      <edc:VirtualPin edc:name="CN35"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="SEG57"/>
      <edc:VirtualPin edc:name="PMA20"/>
      <edc:VirtualPin edc:name="CN36"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="PMA21"/>
      <edc:VirtualPin edc:name="CN37"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="CN38"/>
      <edc:VirtualPin edc:name="RA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
